{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "4b76830b-1677-4028-b75d-ee100dc838d3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "abhishek @Neo4j123 neo4j\n"
     ]
    }
   ],
   "source": [
    "import matplotlib.pyplot as plt    \n",
    "import pandas as pd\n",
    "from neo4j import GraphDatabase\n",
    "import sys\n",
    "\n",
    "import os\n",
    "import requests\n",
    "import json\n",
    "import requests\n",
    "import numpy as np\n",
    "from graphdatascience import GraphDataScience\n",
    "from dotenv import load_dotenv\n",
    "import openai\n",
    "load_dotenv(override=True)\n",
    "\n",
    "openai.api_key = os.environ['OPENAI_API_KEY']\n",
    "database = 'neo4j' \n",
    "uri, user, password = os.getenv('NEO4J_URI'), os.getenv('NEO4J_USER'), os.getenv('NEO4J_PASSWORD')\n",
    "print(user, password, database)\n",
    "gds = GraphDataScience(\n",
    "    uri,\n",
    "    auth = (user, password), database=database\n",
    ")       "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "id": "b13742d3-a040-423d-accb-2dd442cedf1d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                         movieName  movieId  popularity\n",
      "0            2001: A Space Odyssey       62   22.494622\n",
      "2             Addams Family Values     2758   17.555909\n",
      "4                          Aladdin      812   16.357419\n",
      "8                        Apollo 13      568   18.761467\n",
      "6                       Barbarella     8069   14.304205\n",
      "2                           Batman      268   19.106730\n",
      "0                     Blade Runner       78   96.272374\n",
      "1                       Braveheart      197   20.755149\n",
      "8                     Broken Arrow     9208   14.957626\n",
      "7                   Chain Reaction    12123   15.874491\n",
      "8                       Cinderella    11224   14.436858\n",
      "4                     Citizen Kane       15   15.811921\n",
      "7                   Color of Night     2124   14.228963\n",
      "6                     First Knight     6520   15.178338\n",
      "9          For Whom the Bell Tolls    27854   14.373861\n",
      "5                     Forget Paris    10525   16.236745\n",
      "0                     Forrest Gump       13   48.307194\n",
      "8              From Dusk Till Dawn      755   15.339153\n",
      "6                         Gaslight    13528   14.545058\n",
      "9                        GoldenEye      710   14.686036\n",
      "3                             Heat      949   17.924927\n",
      "4                 Independence Day      602   17.634197\n",
      "2                          Jumanji     8844   17.015539\n",
      "3                             Léon      101   20.477329\n",
      "9                     Mary Poppins      433   15.115490\n",
      "6                 Mighty Aphrodite    11448   15.899134\n",
      "9              Mission: Impossible      954   15.793477\n",
      "8                            North    31586   15.534707\n",
      "8                         Outbreak     6950   13.676444\n",
      "0                     Pulp Fiction      680  140.950236\n",
      "3                      Rear Window      567   17.911314\n",
      "3        Robin Hood: Men in Tights     8005   17.136672\n",
      "3                 Schindler's List      424   41.725123\n",
      "4                            Se7en      807   18.457430\n",
      "6  Snow White and the Seven Dwarfs      408   16.263878\n",
      "9                          Species     9348   13.492845\n",
      "8                Striking Distance    11074   13.390917\n",
      "0       Terminator 2: Judgment Day      280   22.661695\n",
      "9                       The Client    10731   15.263829\n",
      "8                         The Crow     9495   15.799336\n",
      "5                    The Lion King     8587   21.605761\n",
      "9                          The Net     1642   13.304342\n",
      "2   The Nightmare Before Christmas     9479   17.730913\n",
      "1         The Shawshank Redemption      278   51.645403\n",
      "7               The Usual Suspects      629   16.302466\n",
      "1                        Toy Story      862   21.946943\n",
      "5                     True Romance      319   17.189328\n",
      "2                          Vertigo      426   18.208220\n",
      "6                       Waterworld     9804   16.885184\n",
      "7          While You Were Sleeping     2064   15.783615\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"MATCH (g:Genre)-[:GENRE]->(m:Movie)<-[:RATING]-(u:User)\n",
    "WITH g, COUNT(DISTINCT u) AS user_count\n",
    "ORDER BY user_count DESC\n",
    "LIMIT 10\n",
    "MATCH (genre:Genre {name: g.name})-[:GENRE]->(movie:Movie)\n",
    "WHERE NOT EXISTS {\n",
    "    MATCH (movie)<-[:RATING]-(user:User {email: 'abhi123@yahoo.com'})\n",
    "}\n",
    "WITH genre.name AS Genre, movie.name AS TopMovies, movie.popularity AS Popularity, movie.id AS movieId\n",
    "ORDER BY genre.name, Popularity DESC\n",
    "WITH Genre, COLLECT({movieName: TopMovies, popularity: Popularity, movieId: movieId})[0..10] AS genreMovies\n",
    "RETURN Genre, genreMovies\n",
    "LIMIT 10;\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "\n",
    "df = pd.concat([pd.DataFrame(x) for x in gds.run_cypher(query,params = {\"email\":'abhi@yahoo.com'}).iloc[:,1]])\n",
    "df.drop_duplicates('movieId',inplace=True)\n",
    "df = df.sample(n=50, random_state=42)  # Adjust `n` as needed, and `random_state` for reproducibility\n",
    "df.sort_values('movieName',inplace=True)\n",
    "print(df)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "917fceaf-9fdb-4ec1-b4a0-1bf811956a37",
   "metadata": {},
   "source": [
    "## Checking Non Repetitive movies whene a user logs in"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "b2c975df-6e9d-4a60-8d33-885230d7e512",
   "metadata": {},
   "outputs": [
    {
     "ename": "CypherSyntaxError",
     "evalue": "{code: Neo.ClientError.Statement.SyntaxError} {message: Variable `g` not defined (line 6, column 27 (offset: 240))\r\n\"MATCH (genre:Genre {name: g.name})-[:GENRE]->(movie:Movie)<-[:RATING]-(u:User)\"\r\n                           ^}",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mCypherSyntaxError\u001b[0m                         Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[64], line 14\u001b[0m\n\u001b[0;32m      1\u001b[0m query \u001b[38;5;241m=\u001b[39m \u001b[38;5;124m\"\"\"\u001b[39m\u001b[38;5;124mMATCH (g:Genre)-[:GENRE]->(m:Movie)<-[:RATING]-(u:User)\u001b[39m\n\u001b[0;32m      2\u001b[0m \u001b[38;5;124mWITH g, COUNT(DISTINCT u) AS user_count\u001b[39m\n\u001b[0;32m      3\u001b[0m \u001b[38;5;124mORDER BY user_count DESC\u001b[39m\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m     10\u001b[0m \u001b[38;5;124mRETURN Genre, genreMovies,userMovies\u001b[39m\n\u001b[0;32m     11\u001b[0m \u001b[38;5;124mLIMIT 10;\u001b[39m\u001b[38;5;124m\"\"\"\u001b[39m\n\u001b[0;32m     13\u001b[0m params \u001b[38;5;241m=\u001b[39m {\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124memail\u001b[39m\u001b[38;5;124m\"\u001b[39m: \u001b[38;5;124m'\u001b[39m\u001b[38;5;124mabhi123@yahoo.com\u001b[39m\u001b[38;5;124m'\u001b[39m}\n\u001b[1;32m---> 14\u001b[0m df \u001b[38;5;241m=\u001b[39m pd\u001b[38;5;241m.\u001b[39mconcat([pd\u001b[38;5;241m.\u001b[39mDataFrame(x) \u001b[38;5;28;01mfor\u001b[39;00m x \u001b[38;5;129;01min\u001b[39;00m \u001b[43mgds\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun_cypher\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43mparams\u001b[49m\u001b[43m)\u001b[49m\u001b[38;5;241m.\u001b[39miloc[:,\u001b[38;5;241m1\u001b[39m]])\n\u001b[0;32m     15\u001b[0m df\u001b[38;5;241m.\u001b[39mdrop_duplicates(\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mmovieId\u001b[39m\u001b[38;5;124m'\u001b[39m,inplace\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mTrue\u001b[39;00m)\n\u001b[0;32m     16\u001b[0m \u001b[38;5;66;03m#df = df.sample(n=50, random_state=42)  # Adjust `n` as needed, and `random_state` for reproducibility\u001b[39;00m\n",
      "File \u001b[1;32m~\\AppData\\Local\\Continuum\\anaconda3\\envs\\streamlit\\lib\\site-packages\\graphdatascience\\graph_data_science.py:211\u001b[0m, in \u001b[0;36mGraphDataScience.run_cypher\u001b[1;34m(self, query, params, database)\u001b[0m\n\u001b[0;32m    208\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_query_runner, ArrowQueryRunner):\n\u001b[0;32m    209\u001b[0m     qr \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_query_runner\u001b[38;5;241m.\u001b[39mfallback_query_runner()\n\u001b[1;32m--> 211\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mqr\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun_cypher\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparams\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mdatabase\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mFalse\u001b[39;49;00m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32m~\\AppData\\Local\\Continuum\\anaconda3\\envs\\streamlit\\lib\\site-packages\\graphdatascience\\query_runner\\neo4j_query_runner.py:126\u001b[0m, in \u001b[0;36mNeo4jQueryRunner.run_cypher\u001b[1;34m(self, query, params, database, custom_error)\u001b[0m\n\u001b[0;32m    124\u001b[0m         \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mhandle_driver_exception(session, e)\n\u001b[0;32m    125\u001b[0m     \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[1;32m--> 126\u001b[0m         \u001b[38;5;28;01mraise\u001b[39;00m e\n\u001b[0;32m    128\u001b[0m \u001b[38;5;66;03m# Though pandas support may be experimental in the `neo4j` package, it should always\u001b[39;00m\n\u001b[0;32m    129\u001b[0m \u001b[38;5;66;03m# be supported in the `graphdatascience` package.\u001b[39;00m\n\u001b[0;32m    130\u001b[0m warnings\u001b[38;5;241m.\u001b[39mfilterwarnings(\n\u001b[0;32m    131\u001b[0m     \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mignore\u001b[39m\u001b[38;5;124m\"\u001b[39m,\n\u001b[0;32m    132\u001b[0m     message\u001b[38;5;241m=\u001b[39m\u001b[38;5;124mr\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m^pandas support is experimental and might be changed or removed in future versions$\u001b[39m\u001b[38;5;124m\"\u001b[39m,\n\u001b[0;32m    133\u001b[0m )\n",
      "File \u001b[1;32m~\\AppData\\Local\\Continuum\\anaconda3\\envs\\streamlit\\lib\\site-packages\\graphdatascience\\query_runner\\neo4j_query_runner.py:121\u001b[0m, in \u001b[0;36mNeo4jQueryRunner.run_cypher\u001b[1;34m(self, query, params, database, custom_error)\u001b[0m\n\u001b[0;32m    119\u001b[0m \u001b[38;5;28;01mwith\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_driver\u001b[38;5;241m.\u001b[39msession(database\u001b[38;5;241m=\u001b[39mdatabase, bookmarks\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mbookmarks()) \u001b[38;5;28;01mas\u001b[39;00m session:\n\u001b[0;32m    120\u001b[0m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 121\u001b[0m         result \u001b[38;5;241m=\u001b[39m \u001b[43msession\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparams\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    122\u001b[0m     \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mException\u001b[39;00m \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[0;32m    123\u001b[0m         \u001b[38;5;28;01mif\u001b[39;00m custom_error:\n",
      "File \u001b[1;32m~\\AppData\\Local\\Continuum\\anaconda3\\envs\\streamlit\\lib\\site-packages\\neo4j\\_sync\\work\\session.py:314\u001b[0m, in \u001b[0;36mSession.run\u001b[1;34m(self, query, parameters, **kwargs)\u001b[0m\n\u001b[0;32m    312\u001b[0m bookmarks \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_get_bookmarks()\n\u001b[0;32m    313\u001b[0m parameters \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mdict\u001b[39m(parameters \u001b[38;5;129;01mor\u001b[39;00m {}, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[1;32m--> 314\u001b[0m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_auto_result\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_run\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    315\u001b[0m \u001b[43m    \u001b[49m\u001b[43mquery\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparameters\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mdatabase\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    316\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mimpersonated_user\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mdefault_access_mode\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    317\u001b[0m \u001b[43m    \u001b[49m\u001b[43mbookmarks\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mnotifications_min_severity\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    318\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_config\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mnotifications_disabled_classifications\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    319\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    321\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_auto_result\n",
      "File \u001b[1;32m~\\AppData\\Local\\Continuum\\anaconda3\\envs\\streamlit\\lib\\site-packages\\neo4j\\_sync\\work\\result.py:221\u001b[0m, in \u001b[0;36mResult._run\u001b[1;34m(self, query, parameters, db, imp_user, access_mode, bookmarks, notifications_min_severity, notifications_disabled_classifications)\u001b[0m\n\u001b[0;32m    219\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_pull()\n\u001b[0;32m    220\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connection\u001b[38;5;241m.\u001b[39msend_all()\n\u001b[1;32m--> 221\u001b[0m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_attach\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32m~\\AppData\\Local\\Continuum\\anaconda3\\envs\\streamlit\\lib\\site-packages\\neo4j\\_sync\\work\\result.py:409\u001b[0m, in \u001b[0;36mResult._attach\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    407\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_exhausted \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[0;32m    408\u001b[0m     \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_attached \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[1;32m--> 409\u001b[0m         \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_connection\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mfetch_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32m~\\AppData\\Local\\Continuum\\anaconda3\\envs\\streamlit\\lib\\site-packages\\neo4j\\_sync\\io\\_common.py:178\u001b[0m, in \u001b[0;36mConnectionErrorHandler.__getattr__.<locals>.outer.<locals>.inner\u001b[1;34m(*args, **kwargs)\u001b[0m\n\u001b[0;32m    176\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21minner\u001b[39m(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs):\n\u001b[0;32m    177\u001b[0m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 178\u001b[0m         func(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[0;32m    179\u001b[0m     \u001b[38;5;28;01mexcept\u001b[39;00m (Neo4jError, ServiceUnavailable, SessionExpired) \u001b[38;5;28;01mas\u001b[39;00m exc:\n\u001b[0;32m    180\u001b[0m         \u001b[38;5;28;01massert\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m asyncio\u001b[38;5;241m.\u001b[39miscoroutinefunction(\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m__on_error)\n",
      "File \u001b[1;32m~\\AppData\\Local\\Continuum\\anaconda3\\envs\\streamlit\\lib\\site-packages\\neo4j\\_sync\\io\\_bolt.py:855\u001b[0m, in \u001b[0;36mBolt.fetch_message\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    851\u001b[0m \u001b[38;5;66;03m# Receive exactly one message\u001b[39;00m\n\u001b[0;32m    852\u001b[0m tag, fields \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39minbox\u001b[38;5;241m.\u001b[39mpop(\n\u001b[0;32m    853\u001b[0m     hydration_hooks\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mresponses[\u001b[38;5;241m0\u001b[39m]\u001b[38;5;241m.\u001b[39mhydration_hooks\n\u001b[0;32m    854\u001b[0m )\n\u001b[1;32m--> 855\u001b[0m res \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_process_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43mtag\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mfields\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    856\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39midle_since \u001b[38;5;241m=\u001b[39m monotonic()\n\u001b[0;32m    857\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m res\n",
      "File \u001b[1;32m~\\AppData\\Local\\Continuum\\anaconda3\\envs\\streamlit\\lib\\site-packages\\neo4j\\_sync\\io\\_bolt5.py:370\u001b[0m, in \u001b[0;36mBolt5x0._process_message\u001b[1;34m(self, tag, fields)\u001b[0m\n\u001b[0;32m    368\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_server_state_manager\u001b[38;5;241m.\u001b[39mstate \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mbolt_states\u001b[38;5;241m.\u001b[39mFAILED\n\u001b[0;32m    369\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 370\u001b[0m     \u001b[43mresponse\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mon_failure\u001b[49m\u001b[43m(\u001b[49m\u001b[43msummary_metadata\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;129;43;01mor\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43m{\u001b[49m\u001b[43m}\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    371\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (ServiceUnavailable, DatabaseUnavailable):\n\u001b[0;32m    372\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mpool:\n",
      "File \u001b[1;32m~\\AppData\\Local\\Continuum\\anaconda3\\envs\\streamlit\\lib\\site-packages\\neo4j\\_sync\\io\\_common.py:245\u001b[0m, in \u001b[0;36mResponse.on_failure\u001b[1;34m(self, metadata)\u001b[0m\n\u001b[0;32m    243\u001b[0m handler \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mhandlers\u001b[38;5;241m.\u001b[39mget(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mon_summary\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[0;32m    244\u001b[0m Util\u001b[38;5;241m.\u001b[39mcallback(handler)\n\u001b[1;32m--> 245\u001b[0m \u001b[38;5;28;01mraise\u001b[39;00m Neo4jError\u001b[38;5;241m.\u001b[39mhydrate(\u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mmetadata)\n",
      "\u001b[1;31mCypherSyntaxError\u001b[0m: {code: Neo.ClientError.Statement.SyntaxError} {message: Variable `g` not defined (line 6, column 27 (offset: 240))\r\n\"MATCH (genre:Genre {name: g.name})-[:GENRE]->(movie:Movie)<-[:RATING]-(u:User)\"\r\n                           ^}"
     ]
    }
   ],
   "source": [
    "query = \"\"\"MATCH (g:Genre)-[:GENRE]->(m:Movie)<-[:RATING]-(u:User)\n",
    "WITH g, COUNT(DISTINCT u) AS user_count\n",
    "ORDER BY user_count DESC\n",
    "LIMIT 10\n",
    "MATCH (genre:Genre {name: g.name})-[:GENRE]->(movie:Movie)<-[:RATING]-(u:User)\n",
    "WITH genre.name AS Genre, movie.name AS TopMovies, movie.popularity AS Popularity, movie.id AS movieId\n",
    "ORDER BY genre.name, Popularity DES\n",
    "WITH Genre, COLLECT({movieName: TopMovies, popularity: Popularity, movieId: movieId})[0..10] AS genreMovies, userMovies\n",
    "RETURN Genre, genreMovies,userMovies\n",
    "LIMIT 10;\"\"\"\n",
    "\n",
    "query2 = \"\"\"MATCH (movie)<-[:RATING]-(user:User {email: $email}) WITH movie.name as userMovies\"\"\"\n",
    "\n",
    "params = {\"email\": 'abhi123@yahoo.com'}\n",
    "df = pd.concat([pd.DataFrame(x) for x in gds.run_cypher(query,params).iloc[:,1]])\n",
    "df.drop_duplicates('movieId',inplace=True)\n",
    "#df = df.sample(n=50, random_state=42)  # Adjust `n` as needed, and `random_state` for reproducibility\n",
    "print(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "id": "53f47b08-6a5c-440f-8a28-d0b811f371ec",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                         movieName  movieId  popularity\n",
      "2             Addams Family Values     2758   17.555909\n",
      "9                          The Net     1642   13.304342\n",
      "8                Striking Distance    11074   13.390917\n",
      "4                          Jumanji     8844   17.015539\n",
      "4                     Citizen Kane       15   15.811921\n",
      "5                 Independence Day      602   17.634197\n",
      "0                     Forrest Gump       13   48.307194\n",
      "8                     Frankenstein     3036   14.287753\n",
      "3                           Batman      268   19.106730\n",
      "8               The Usual Suspects      629   16.302466\n",
      "6                          Aladdin      812   16.357419\n",
      "8                   Chain Reaction    12123   15.874491\n",
      "0                     Pulp Fiction      680  140.950236\n",
      "6                     True Romance      319   17.189328\n",
      "0                     Blade Runner       78   96.272374\n",
      "4                             Heat      949   17.924927\n",
      "9                        Apollo 13      568   18.761467\n",
      "8                            North    31586   15.534707\n",
      "5                       The Client    10731   15.263829\n",
      "9              From Dusk Till Dawn      755   15.339153\n",
      "9                       Cinderella    11224   14.436858\n",
      "8                     First Knight     6520   15.178338\n",
      "9                         The Crow     9495   15.799336\n",
      "9                         Maverick     9359   15.050326\n",
      "4                    Trainspotting      627   19.348466\n",
      "5                    The Lion King     8587   21.605761\n",
      "9                     Mary Poppins      433   15.115490\n",
      "2                 The Wizard of Oz      630   22.064932\n",
      "0                        Star Wars       11   42.149697\n",
      "7                   Color of Night     2124   14.228963\n",
      "1         The Shawshank Redemption      278   51.645403\n",
      "5                            Se7en      807   18.457430\n",
      "4   The Nightmare Before Christmas     9479   17.730913\n",
      "3                             Léon      101   20.477329\n",
      "6                         Gaslight    13528   14.545058\n",
      "1       Terminator 2: Judgment Day      280   22.661695\n",
      "5                     Forget Paris    10525   16.236745\n",
      "2                       Braveheart      197   20.755149\n",
      "8  Snow White and the Seven Dwarfs      408   16.263878\n",
      "1             Beauty and the Beast    10020   23.433511\n",
      "3                 Schindler's List      424   41.725123\n",
      "7          While You Were Sleeping     2064   15.783615\n",
      "3                      Rear Window      567   17.911314\n",
      "1            2001: A Space Odyssey       62   22.494622\n",
      "6                 Mighty Aphrodite    11448   15.899134\n",
      "1                        Toy Story      862   21.946943\n",
      "9                         Outbreak     6950   13.676444\n",
      "3        Robin Hood: Men in Tights     8005   17.136672\n",
      "7                       Waterworld     9804   16.885184\n",
      "2                          Vertigo      426   18.208220\n",
      "['Star Wars', 'Beauty and the Beast', 'Trainspotting', 'The Wizard of Oz']\n"
     ]
    }
   ],
   "source": [
    "query2 = \"\"\"MATCH (movie)<-[:RATING]-(user:User {email: $email}) Return movie.name as userMovies\"\"\"\n",
    "params = {\"email\": 'abhi123@yahoo.com'}\n",
    "df2 = gds.run_cypher(query2,params)\n",
    "selectedMovies = df2.iloc[:,0].to_list()\n",
    "\n",
    "query = \"\"\"MATCH (g:Genre)-[:GENRE]->(m:Movie)<-[:RATING]-(u:User)\n",
    "    WITH g, COUNT(DISTINCT u) AS user_count\n",
    "    ORDER BY user_count DESC\n",
    "    LIMIT 10\n",
    "    MATCH (genre:Genre {name: g.name})-[:GENRE]->(movie:Movie)\n",
    "    WITH genre.name AS Genre, movie.name AS TopMovies, movie.popularity AS Popularity,movie.id as movieId\n",
    "    ORDER BY genre.name, Popularity DESC\n",
    "    WITH Genre , COLLECT({movieName:TopMovies, popularity: Popularity,movieId:movieId})[0..10] as genreMovies\n",
    "    return Genre, genreMovies\n",
    "    LIMIT 10;\"\"\"\n",
    "df = pd.concat([pd.DataFrame(x) for x in gds.run_cypher(query).iloc[:,1]])\n",
    "df.drop_duplicates('movieId',inplace=True)\n",
    "df = df.sample(n=50, random_state=42)  # Adjust `n` as needed, and `random_state` for reproducibility\n",
    "\n",
    "print(df)\n",
    "print(selectedMovies)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "bec62993-71e9-42c0-8509-51d239039fa6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                         movieName  movieId  popularity\n",
      "2             Addams Family Values     2758   17.555909\n",
      "9                          The Net     1642   13.304342\n",
      "8                Striking Distance    11074   13.390917\n",
      "4                          Jumanji     8844   17.015539\n",
      "4                     Citizen Kane       15   15.811921\n",
      "5                 Independence Day      602   17.634197\n",
      "0                     Forrest Gump       13   48.307194\n",
      "8                     Frankenstein     3036   14.287753\n",
      "3                           Batman      268   19.106730\n",
      "8               The Usual Suspects      629   16.302466\n",
      "6                          Aladdin      812   16.357419\n",
      "8                   Chain Reaction    12123   15.874491\n",
      "0                     Pulp Fiction      680  140.950236\n",
      "6                     True Romance      319   17.189328\n",
      "0                     Blade Runner       78   96.272374\n",
      "4                             Heat      949   17.924927\n",
      "9                        Apollo 13      568   18.761467\n",
      "8                            North    31586   15.534707\n",
      "5                       The Client    10731   15.263829\n",
      "9              From Dusk Till Dawn      755   15.339153\n",
      "9                       Cinderella    11224   14.436858\n",
      "8                     First Knight     6520   15.178338\n",
      "9                         The Crow     9495   15.799336\n",
      "9                         Maverick     9359   15.050326\n",
      "4                    Trainspotting      627   19.348466\n",
      "5                    The Lion King     8587   21.605761\n",
      "9                     Mary Poppins      433   15.115490\n",
      "2                 The Wizard of Oz      630   22.064932\n",
      "0                        Star Wars       11   42.149697\n",
      "7                   Color of Night     2124   14.228963\n",
      "1         The Shawshank Redemption      278   51.645403\n",
      "5                            Se7en      807   18.457430\n",
      "4   The Nightmare Before Christmas     9479   17.730913\n",
      "3                             Léon      101   20.477329\n",
      "6                         Gaslight    13528   14.545058\n",
      "1       Terminator 2: Judgment Day      280   22.661695\n",
      "5                     Forget Paris    10525   16.236745\n",
      "2                       Braveheart      197   20.755149\n",
      "8  Snow White and the Seven Dwarfs      408   16.263878\n",
      "1             Beauty and the Beast    10020   23.433511\n",
      "3                 Schindler's List      424   41.725123\n",
      "7          While You Were Sleeping     2064   15.783615\n",
      "3                      Rear Window      567   17.911314\n",
      "1            2001: A Space Odyssey       62   22.494622\n",
      "6                 Mighty Aphrodite    11448   15.899134\n",
      "1                        Toy Story      862   21.946943\n",
      "9                         Outbreak     6950   13.676444\n",
      "3        Robin Hood: Men in Tights     8005   17.136672\n",
      "7                       Waterworld     9804   16.885184\n",
      "2                          Vertigo      426   18.208220\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"MATCH (g:Genre)-[:GENRE]->(m:Movie)<-[:RATING]-(u:User)\n",
    "    WITH g, COUNT(DISTINCT u) AS user_count\n",
    "    ORDER BY user_count DESC\n",
    "    LIMIT 10\n",
    "    MATCH (genre:Genre {name: g.name})-[:GENRE]->(movie:Movie)\n",
    "    WITH genre.name AS Genre, movie.name AS TopMovies, movie.popularity AS Popularity,movie.id as movieId\n",
    "    ORDER BY genre.name, Popularity DESC\n",
    "    WITH Genre , COLLECT({movieName:TopMovies, popularity: Popularity,movieId:movieId})[0..10] as genreMovies\n",
    "    return Genre, genreMovies\n",
    "    LIMIT 10;\"\"\"\n",
    "\n",
    "df = pd.concat([pd.DataFrame(x) for x in gds.run_cypher(query).iloc[:,1]])\n",
    "df.drop_duplicates('movieId',inplace=True)\n",
    "df = df.sample(n=50, random_state=42)  # Adjust `n` as needed, and `random_state` for reproducibility\n",
    "print(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "4d71e8fa-da6d-4bfa-8099-c8afd2bfe8d4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "          Movie1                                   Movie2  movieId  \\\n",
      "0    Baby Driver                                    Ted 2   214756   \n",
      "1    Baby Driver                             Wonder Woman   297762   \n",
      "2          Ted 2                              Baby Driver   339403   \n",
      "6   Pulp Fiction               Die Hard: With a Vengeance     1572   \n",
      "7   Pulp Fiction                          P.S. I Love You     6023   \n",
      "8   Pulp Fiction           Frankenstein Must Be Destroyed     3075   \n",
      "9   Pulp Fiction                 A Streetcar Named Desire      702   \n",
      "10  Pulp Fiction                                    Ronin     8195   \n",
      "11  Pulp Fiction       The World, the Flesh and the Devil     4928   \n",
      "12  Pulp Fiction                     The First Wives Club     2925   \n",
      "13  Pulp Fiction                                Baise-moi     3134   \n",
      "14  Pulp Fiction              Wizards of the Lost Kingdom     7234   \n",
      "15  Pulp Fiction  Midnight in the Garden of Good and Evil     8197   \n",
      "16   Baby Driver                             Pulp Fiction      680   \n",
      "\n",
      "    similarity                                         posterLink  \n",
      "0     1.000000  http://image.tmdb.org/t/p/w185//qMOt0uy1x49OBW...  \n",
      "1     1.000000  http://image.tmdb.org/t/p/w185//paKWqpEGiHilKf...  \n",
      "2     1.000000  http://image.tmdb.org/t/p/w185//9Kvt59cX0tQlxT...  \n",
      "6     0.135492  http://image.tmdb.org/t/p/w185//lMc9O6y1Pz07KG...  \n",
      "7     0.116992  http://image.tmdb.org/t/p/w185//bZlRZKBOR6cC8L...  \n",
      "8     0.113523  http://image.tmdb.org/t/p/w185//rLCCdYBhCm4ATk...  \n",
      "9     0.101472  http://image.tmdb.org/t/p/w185//aicdlO5vt7z2AR...  \n",
      "10    0.095436  http://image.tmdb.org/t/p/w185//AirrhRJjHwytOV...  \n",
      "11    0.094822  http://image.tmdb.org/t/p/w185//uMB51OAkdrAx7r...  \n",
      "12    0.094505  http://image.tmdb.org/t/p/w185//2ApifgYnfdJUSm...  \n",
      "13    0.093443  http://image.tmdb.org/t/p/w185//r07olKMs2bMksj...  \n",
      "14    0.092845  http://image.tmdb.org/t/p/w185//ClvJt5N66xSX4h...  \n",
      "15    0.092297  http://image.tmdb.org/t/p/w185//r11m3HnbliO5mK...  \n",
      "16    0.000999  http://image.tmdb.org/t/p/w185//d5iIlFn5s0Imsz...  \n",
      "<Response [200]>\n",
      "<Response [200]>\n",
      "<Response [200]>\n",
      "<Response [200]>\n",
      "<Response [200]>\n",
      "<Response [200]>\n",
      "<Response [200]>\n",
      "<Response [200]>\n",
      "<Response [200]>\n",
      "<Response [200]>\n",
      "<Response [200]>\n",
      "<Response [200]>\n",
      "<Response [200]>\n",
      "<Response [200]>\n",
      "          Movie1                                   Movie2  movieId  \\\n",
      "0    Baby Driver                                    Ted 2   214756   \n",
      "1    Baby Driver                             Wonder Woman   297762   \n",
      "2          Ted 2                              Baby Driver   339403   \n",
      "6   Pulp Fiction               Die Hard: With a Vengeance     1572   \n",
      "7   Pulp Fiction                          P.S. I Love You     6023   \n",
      "8   Pulp Fiction           Frankenstein Must Be Destroyed     3075   \n",
      "9   Pulp Fiction                 A Streetcar Named Desire      702   \n",
      "10  Pulp Fiction                                    Ronin     8195   \n",
      "11  Pulp Fiction       The World, the Flesh and the Devil     4928   \n",
      "12  Pulp Fiction                     The First Wives Club     2925   \n",
      "13  Pulp Fiction                                Baise-moi     3134   \n",
      "14  Pulp Fiction              Wizards of the Lost Kingdom     7234   \n",
      "15  Pulp Fiction  Midnight in the Garden of Good and Evil     8197   \n",
      "16   Baby Driver                             Pulp Fiction      680   \n",
      "\n",
      "    similarity                                         posterLink  \n",
      "0     1.000000  http://image.tmdb.org/t/p/w185//qMOt0uy1x49OBW...  \n",
      "1     1.000000  http://image.tmdb.org/t/p/w185//paKWqpEGiHilKf...  \n",
      "2     1.000000  http://image.tmdb.org/t/p/w185//9Kvt59cX0tQlxT...  \n",
      "6     0.135492  http://image.tmdb.org/t/p/w185//lMc9O6y1Pz07KG...  \n",
      "7     0.116992  http://image.tmdb.org/t/p/w185//bZlRZKBOR6cC8L...  \n",
      "8     0.113523  http://image.tmdb.org/t/p/w185//rLCCdYBhCm4ATk...  \n",
      "9     0.101472  http://image.tmdb.org/t/p/w185//aicdlO5vt7z2AR...  \n",
      "10    0.095436  http://image.tmdb.org/t/p/w185//AirrhRJjHwytOV...  \n",
      "11    0.094822  http://image.tmdb.org/t/p/w185//uMB51OAkdrAx7r...  \n",
      "12    0.094505  http://image.tmdb.org/t/p/w185//2ApifgYnfdJUSm...  \n",
      "13    0.093443  http://image.tmdb.org/t/p/w185//r07olKMs2bMksj...  \n",
      "14    0.092845  http://image.tmdb.org/t/p/w185//ClvJt5N66xSX4h...  \n",
      "15    0.092297  http://image.tmdb.org/t/p/w185//r11m3HnbliO5mK...  \n",
      "16    0.000999  http://image.tmdb.org/t/p/w185//d5iIlFn5s0Imsz...  \n"
     ]
    }
   ],
   "source": [
    "print(similarity)\n",
    "\n",
    "def getImage(movieId):\n",
    "    \n",
    "    '''\n",
    "    Get Images using the TMDB API\n",
    "    '''\n",
    "    \n",
    "    url = f\"https://api.themoviedb.org/3/movie/{movieId}/images\"+\"?api_key=1a23dabc3e8f21345d6e1efb8b47db48\"    \n",
    "    headers = {\n",
    "        \"accept\": \"application/json\",\n",
    "        \"Authorization\": \"Bearer \"+os.getenv('MOVIE_API_TOKEN')\n",
    "    }    \n",
    "    response = requests.get(url) \n",
    "    print(response)\n",
    "    vals = json.loads(response.text)['posters']    \n",
    "    vals = ['http://image.tmdb.org/t/p/w185/' + x['file_path'] if x['iso_639_1']=='en' else 'http://image.tmdb.org/t/p/w185/' + x['file_path'] for x in vals]\n",
    "    return vals[0]\n",
    "\n",
    "\n",
    "similarity['posterLink'] = similarity['movieId'].apply(lambda x : getImage(x))  \n",
    "print(similarity)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.14"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
